% most current Time-stamp: <2012-09-22 22:12:59 vk>

This Org-mode file is best viewed in GNU Emacs with
[[http://orgmode.org][Org-mode]]. Statistical analysis is done with [[http://orgmode.org/worg/org-contrib/babel/][Babel]]. This file is using
an [[http://www.r-project.org/][R]]-library from Lewis2012 on
[[http://www.measuringusability.com/products/excel-ux-book]]

Re-generate results with Babel:
1. open this file with GNU Emacs 23 or higher
2. To generate a boxplot, import CSV file into the table by
   executing the sh-block (using: C-c C-c) and
3. execute the R command (using: C-c C-c)

*NOTE*: generating most boxplots in this file is *optional* because
 the generation of boxplots has been moved to "generate_boxplots.sh"
 and "generate_boxplots.R"!


Handy macro for Emacs, inserting two columns from spreadsheets and
re-formatting for Org-mode tables:
(fset 'vk-libreoffice-values-to-orgmode-table
   [?\C-  C-up down escape ?% tab return ?  ?| ?  return ?! ?\C-a down ?\C-  C-up down escape ?% ?, return ?. return ?! ?\C-a ?\C-  C-up down ?\C-x ?r ?t ?| ?  return up ?\C-k tab])


* data and statistics

** Folders

#+NAME: list_of_all_folders_without_paths-lengths
#+BEGIN_SRC sh :exports both 
sort -n TP_artifacts/folders_without_path_-_lengths.csv
#+END_SRC

#+RESULTS: list_of_all_folders_without_paths-lengths
|  2 |
|  2 |
|  2 |
|  2 |
|  2 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 14 |
| 14 |
| 14 |
| 15 |
| 15 |
| 15 |
| 16 |
| 16 |
| 16 |
| 16 |
| 16 |
| 17 |
| 17 |
| 18 |
| 19 |
| 19 |
| 20 |
| 20 |
| 21 |
| 22 |
| 23 |
| 24 |

#+NAME: unique-folders-per-TP
#+BEGIN_SRC sh :exports both
sort -n TP_artifacts/folders_number_of_unique_per_TP.csv
#+END_SRC

#+RESULTS: unique-folders-per-TP
|  4 |
|  6 |
|  7 |
|  8 |
| 10 |
| 10 |
| 11 |
| 11 |
| 13 |
| 13 |
| 13 |
| 14 |
| 14 |
| 16 |
| 16 |
| 16 |
| 17 |
| 17 |
| 17 |
| 18 |
| 18 |
| 21 |
| 31 |


** tags

#+NAME: all_tags_-_lengths
#+BEGIN_SRC sh :exports both
sort -n TP_artifacts/tags_concated_-_raw_tags_single_unique_-_lengths.csv
#+END_SRC

#+RESULTS: all_tags_-_lengths
|  2 |
|  2 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  3 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  4 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  5 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  6 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  7 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  8 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
|  9 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 10 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 11 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 12 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 13 |
| 14 |
| 14 |
| 14 |
| 14 |
| 14 |
| 14 |
| 14 |
| 14 |
| 14 |
| 14 |
| 14 |
| 14 |
| 14 |
| 14 |
| 14 |
| 14 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 15 |
| 16 |
| 16 |
| 16 |
| 16 |
| 16 |
| 16 |
| 16 |
| 16 |
| 16 |
| 16 |
| 16 |
| 16 |
| 16 |
| 16 |
| 17 |
| 17 |
| 17 |
| 17 |
| 17 |
| 18 |
| 18 |
| 18 |
| 18 |
| 18 |
| 18 |
| 18 |
| 18 |
| 18 |
| 19 |
| 20 |
| 20 |
| 21 |
| 21 |
| 21 |
| 22 |
| 22 |
| 22 |
| 22 |
| 22 |
| 22 |
| 24 |
| 25 |
| 26 |


#+NAME: unique-tags-per-TP
#+BEGIN_SRC sh :exports both
sort -n TP_artifacts/tags_number_of_unique_per_TP.csv
#+END_SRC

#+RESULTS: unique-tags-per-TP
|   7 |
|  12 |
|  17 |
|  20 |
|  24 |
|  26 |
|  26 |
|  27 |
|  29 |
|  30 |
|  30 |
|  33 |
|  36 |
|  37 |
|  42 |
|  51 |
|  52 |
|  68 |
|  70 |
|  75 |
|  77 |
|  84 |
|  84 |
| 112 |


** Filing

copied from spreadsheet:
#+TBLNAME: fe2-filing-folders-tagstore
| folders | tagstore |
|---------+----------|
|     264 |      488 |
|     486 |      590 |
|     570 |      612 |
|     608 |      646 |
|     610 |      665 |
|     659 |      706 |
|     685 |      713 |
|     766 |      802 |
|     785 |     1154 |
|     860 |     1160 |
|     968 |     1168 |
|     982 |     1231 |
|     357 |      660 |
|     491 |      801 |
|     492 |      971 |
|     551 |     1062 |
|     565 |     1070 |
|     619 |     1208 |
|     694 |     1255 |
|     724 |     1322 |
|     765 |     1373 |
|     917 |     1455 |
|     932 |     1972 |
|     938 |     1991 |

*** group 1 vs. group 2

copied from spreadsheet:
#+TBLNAME: fe2-filing-folders-grps
| group1 | group2 |
|--------+--------|
|    264 |    357 |
|    486 |    491 |
|    570 |    492 |
|    608 |    551 |
|    610 |    565 |
|    659 |    619 |
|    685 |    694 |
|    766 |    724 |
|    785 |    765 |
|    860 |    917 |
|    968 |    932 |
|    982 |    938 |

#+BEGIN_SRC R :var mydata= fe2-filing-folders-grps :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(group1,group2,.95)
#+END_SRC

#+RESULTS:
#+begin_example

RESULTS

t: 1.151750 
df: 11 
p: 0.2738418 

95% confidence interval 
Upper limit: 48.03136 
Mean difference: 16.5 
Lower limit: -15.03136 
Margin of error: 31.53136 

#+end_example

-> filing folders group: no significant difference

copied from spreadsheet:
#+TBLNAME: fe2-filing-tagstore-grps
| group1 | group2 |
|--------+--------|
|    488 |    660 |
|    590 |    801 |
|    612 |    971 |
|    646 |   1062 |
|    665 |   1070 |
|    706 |   1208 |
|    713 |   1255 |
|    802 |   1322 |
|   1154 |   1373 |
|   1160 |   1455 |
|   1168 |   1972 |
|   1231 |   1991 |

#+BEGIN_SRC R :var mydata= fe2-filing-tagstore-grps :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(group1,group2,.95)
#+END_SRC

#+RESULTS:
#+begin_example

RESULTS

t: -7.367133 
df: 11 
p: 1.417309e-05 

95% confidence interval 
Upper limit: -304.164 
Mean difference: -433.75 
Lower limit: -563.336 
Margin of error: 129.586 

#+end_example

-> filing tagstore groups: (very) significant difference

*** gender

copied from spreadsheet:
#+TBLNAME: fe2-filing-folder-gender
| male | female |
|------+--------|
|  357 |    264 |
|  491 |    492 |
|  486 |    570 |
|  565 |    765 |
|  551 |    860 |
|  610 |    938 |
|  619 |    917 |
|  608 |    968 |
|  659 |        |
|  685 |        |
|  694 |        |
|  724 |        |
|  766 |        |
|  785 |        |
|  932 |        |
|  982 |        |

|      |   male | female |
|------+--------+--------|
| mean | 657.12 | 721.75 |
| SE   |  39.04 |  61.62 |
#+TBLFM: @2$2=vmean(remote(fe2-filing-folder-gender,@2$1..@>$1));%.2f :: @3$2=vsdev(remote(fe2-filing-folder-gender,@2$1..@>$1))/sqrt(17);%.2f :: @2$3=vmean(remote(fe2-filing-folder-gender,@2$2..@>$2));%.2f :: @3$3=vsdev(remote(fe2-filing-folder-gender,@2$2..@>$2))/sqrt(17);%.2f

#+BEGIN_SRC R :var mydata= fe2-filing-folder-gender :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(male,female[0:8],.95)

library(plotrix)
sprintf("female: mean: %.2f  stderr: %.2f", mean(female[0:8]), std.error(female[0:8]))
sprintf("male:   mean: %.2f  stderr: %.2f", mean(male), std.error(male))

#+END_SRC

#+RESULTS:
#+begin_example

RESULTS

t: -1.238606 
df: 15 
p: 0.2345251 

95% confidence interval 
Upper limit: 46.58461 
Mean difference: -64.625 
Lower limit: -175.8346 
Margin of error: 111.2096 

[1] "female: mean: 721.75  stderr: 89.83"
[1] "male:   mean: 657.12  stderr: 40.24"
#+end_example

-> filing folder gender: no significant difference

copied from spreadsheet:
#+TBLNAME: fe2-filing-tagstore-gender
| male | female |
|------+--------|
|  590 |    488 |
|  612 |    646 |
|  665 |    660 |
|  706 |    713 |
|  801 |    802 |
| 1062 |    971 |
| 1070 |   1255 |
| 1154 |   1322 |
| 1160 |        |
| 1168 |        |
| 1208 |        |
| 1231 |        |
| 1373 |        |
| 1455 |        |
| 1972 |        |
| 1991 |        |

|      |    male | female |
|------+---------+--------|
| mean | 1138.62 | 857.12 |
| SE   |  103.00 |  72.81 |
#+TBLFM: @2$2=vmean(remote(fe2-filing-tagstore-gender,@2$1..@>$1));%.2f :: @3$2=vsdev(remote(fe2-filing-tagstore-gender,@2$1..@>$1))/sqrt(17);%.2f :: @2$3=vmean(remote(fe2-filing-tagstore-gender,@2$2..@>$2));%.2f :: @3$3=vsdev(remote(fe2-filing-tagstore-gender,@2$2..@>$2))/sqrt(17);%.2f

#+BEGIN_SRC R :var mydata= fe2-filing-tagstore-gender :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(male,female[0:8],.95)
mean(male)
mean(female[0:8])
#+END_SRC

#+RESULTS:
#+begin_example

RESULTS

t: 3.416692 
df: 15 
p: 0.003824515 

95% confidence interval 
Upper limit: 457.1093 
Mean difference: 281.5 
Lower limit: 105.8907 
Margin of error: 175.6093 

[1] 1138.625
[1] 857.125
#+end_example

-> filing tagstore gender: very significant difference: females faster

*** tagging experience

#+TBLNAME: fe2-filing-folder-taggers
| tagger | notagger |
|--------+----------|
|    357 |      264 |
|    486 |      565 |
|    491 |      570 |
|    492 |      619 |
|    551 |      659 |
|    608 |      860 |
|    610 |      917 |
|    685 |      938 |
|    694 |      968 |
|    724 |      982 |
|    765 |          |
|    766 |          |
|    785 |          |
|    932 |          |

|      | tagger | notagger |
|------+--------+----------|
| mean | 639.00 |   734.20 |
| SE   |  37.30 |    57.31 |
#+TBLFM: @2$2=vmean(remote(fe2-filing-folder-taggers,@2$1..@>$1));%.2f :: @3$2=vsdev(remote(fe2-filing-folder-taggers,@2$1..@>$1))/sqrt(17);%.2f :: @2$3=vmean(remote(fe2-filing-folder-taggers,@2$2..@>$2));%.2f :: @3$3=vsdev(remote(fe2-filing-folder-taggers,@2$2..@>$2))/sqrt(17);%.2f

#+BEGIN_SRC R :var mydata= fe2-filing-folder-taggers :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(tagger,notagger[0:10],.95)
#+END_SRC

#+RESULTS:
#+begin_example

RESULTS

t: -0.4364034 
df: 13 
p: 0.6697042 

95% confidence interval 
Upper limit: 116.8188 
Mean difference: -29.57143 
Lower limit: -175.9616 
Margin of error: 146.3902 

#+end_example

-> fe2-filing-folder-taggers: no significant difference

#+TBLNAME: fe2-filing-tagstore-taggers
| tagger | notagger |
|--------+----------|
|    665 |      488 |
|    612 |     1154 |
|    706 |      590 |
|   1231 |      713 |
|   1160 |      802 |
|    801 |      646 |
|   1972 |     1070 |
|   1991 |     1255 |
|   1208 |     1062 |
|   1455 |      971 |
|   1322 |          |
|   1373 |          |
|    660 |          |
|   1168 |          |

|      |  tagger | notagger |
|------+---------+----------|
| mean | 1166.00 |   875.10 |
| SE   |  109.42 |    63.63 |
#+TBLFM: @2$2=vmean(remote(fe2-filing-tagstore-taggers,@2$1..@>$1));%.2f :: @3$2=vsdev(remote(fe2-filing-tagstore-taggers,@2$1..@>$1))/sqrt(17);%.2f :: @2$3=vmean(remote(fe2-filing-tagstore-taggers,@2$2..@>$2));%.2f :: @3$3=vsdev(remote(fe2-filing-tagstore-taggers,@2$2..@>$2))/sqrt(17);%.2f

#+BEGIN_SRC R :var mydata= fe2-filing-tagstore-taggers :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(tagger,notagger[0:10],.95)
mean(tagger)
mean(notagger[0:10])
#+END_SRC

#+RESULTS:
#+begin_example

RESULTS

t: 3.328199 
df: 13 
p: 0.005444235 

95% confidence interval 
Upper limit: 545.1488 
Mean difference: 330.5714 
Lower limit: 115.9941 
Margin of error: 214.5773 

[1] 1166
[1] 875.1
#+end_example

-> fe2-filing-tagstore-taggers: very significant difference: notaggers faster

*** platform

#+TBLNAME: fe2-filing-folder-platform
| windows | other |
|---------+-------|
|     982 |   766 |
|     659 |   264 |
|     608 |   659 |
|     968 |   785 |
|     968 |   608 |
|     570 |   685 |
|     486 |   860 |
|     724 |   551 |
|     565 |   932 |
|     917 |   357 |
|     357 |   357 |
|     357 |   694 |
|     619 |   765 |
|     938 |   491 |
|     938 |   491 |
|     492 |   492 |
|     610 |   492 |

|      | windows |  other |
|------+---------+--------|
| mean |  691.65 | 602.88 |
| SE   |   53.11 |  45.65 |
#+TBLFM: @2$2=vmean(remote(fe2-filing-folder-platform,@2$1..@>$1));%.2f :: @3$2=vsdev(remote(fe2-filing-folder-platform,@2$1..@>$1))/sqrt(17);%.2f :: @2$3=vmean(remote(fe2-filing-folder-platform,@2$2..@>$2));%.2f :: @3$3=vsdev(remote(fe2-filing-folder-platform,@2$2..@>$2))/sqrt(17);%.2f

#+BEGIN_SRC R :var mydata= fe2-filing-folder-platform :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(windows,other,.95)
#+END_SRC

#+RESULTS:
#+begin_example

RESULTS

t: 1.231045 
df: 16 
p: 0.2360961 

95% confidence interval 
Upper limit: 241.6209 
Mean difference: 88.7647 
Lower limit: -64.09147 
Margin of error: 152.8562 

#+end_example

-> fe2-filing-folder-platform: no significant difference

#+TBLNAME: fe2-filing-tagstore-platform
| windows | other |
|---------+-------|
|    1154 |   665 |
|     590 |   488 |
|     706 |   590 |
|     713 |   612 |
|     713 |   706 |
|     646 |  1231 |
|    1160 |   802 |
|    1972 |   801 |
|    1070 |  1991 |
|    1255 |  1208 |
|    1208 |  1208 |
|    1208 |  1455 |
|    1062 |  1322 |
|     971 |  1373 |
|     971 |  1373 |
|     660 |   660 |
|    1168 |   660 |

|      | windows |   other |
|------+---------+---------|
| mean | 1013.35 | 1008.53 |
| SE   |   82.28 |  101.44 |
#+TBLFM: @2$2=vmean(remote(fe2-filing-tagstore-platform,@2$1..@>$1));%.2f :: @3$2=vsdev(remote(fe2-filing-tagstore-platform,@2$1..@>$1))/sqrt(17);%.2f :: @2$3=vmean(remote(fe2-filing-tagstore-platform,@2$2..@>$2));%.2f :: @3$3=vsdev(remote(fe2-filing-tagstore-platform,@2$2..@>$2))/sqrt(17);%.2f


#+BEGIN_SRC R :var mydata= fe2-filing-tagstore-platform :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(windows,other,.95)
#+END_SRC

#+RESULTS:
#+begin_example

RESULTS

t: 0.04149853 
df: 16 
p: 0.967412 

95% confidence interval 
Upper limit: 251.2280 
Mean difference: 4.823529 
Lower limit: -241.581 
Margin of error: 246.4045 

#+end_example

-> fe2-filing-tagstore-platform: no significant difference

*** IT studies

#+TBLNAME: fe2-filing-folder-studies
| ITstudies | other |
|-----------+-------|
|       357 |   264 |
|       491 |   357 |
|       492 |   619 |
|       551 |   766 |
|       619 |   785 |
|       685 |   785 |
|       724 |   860 |
|       765 |   860 |
|       785 |   932 |
|       860 |   932 |
|       932 |   982 |
|       982 |       |

|      | ITstudies |  other |
|------+-----------+--------|
| mean |    686.92 | 740.18 |
| SE   |     46.39 |  57.07 |
#+TBLFM: @2$2=vmean(remote(fe2-filing-folder-studies,@2$1..@>$1));%.2f :: @3$2=vsdev(remote(fe2-filing-folder-studies,@2$1..@>$1))/sqrt(17);%.2f :: @2$3=vmean(remote(fe2-filing-folder-studies,@2$2..@>$2));%.2f :: @3$3=vsdev(remote(fe2-filing-folder-studies,@2$2..@>$2))/sqrt(17);%.2f

#+BEGIN_SRC R :var mydata= fe2-filing-folder-studies :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(ITstudies,other[0:11],.95)
mean(ITstudies)
mean(other[0:11])
#+END_SRC

#+RESULTS:
#+begin_example

RESULTS

t: -0.1869775 
df: 11 
p: 0.8550822 

95% confidence interval 
Upper limit: 146.3113 
Mean difference: -13.58333 
Lower limit: -173.478 
Margin of error: 159.8947 

[1] 686.9167
[1] 740.1818
#+end_example

-> fe2-filing-folder-studies: no significant difference

#+TBLNAME: fe2-filing-tagstore-studies
| ITstudies | other |
|-----------+-------|
|       612 |   488 |
|       660 |   612 |
|       801 |   612 |
|       802 |   665 |
|      1062 |   802 |
|      1154 |   802 |
|      1208 |  1062 |
|      1231 |  1154 |
|      1322 |  1208 |
|      1373 |  1991 |
|      1972 |  1991 |
|      1991 |       |

|      | ITstudies |   other |
|------+-----------+---------|
| mean |   1182.33 | 1035.18 |
| SE   |    109.44 |  127.77 |
#+TBLFM: @2$2=vmean(remote(fe2-filing-tagstore-studies,@2$1..@>$1));%.2f :: @3$2=vsdev(remote(fe2-filing-tagstore-studies,@2$1..@>$1))/sqrt(17);%.2f :: @2$3=vmean(remote(fe2-filing-tagstore-studies,@2$2..@>$2));%.2f :: @3$3=vsdev(remote(fe2-filing-tagstore-studies,@2$2..@>$2))/sqrt(17);%.2f

#+BEGIN_SRC R :var mydata= fe2-filing-tagstore-studies :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(ITstudies,other[0:11],.95)
mean(ITstudies)
mean(other[0:11])
#+END_SRC

#+RESULTS:
#+begin_example

RESULTS

t: 1.400765 
df: 11 
p: 0.1888575 

95% confidence interval 
Upper limit: 495.6129 
Mean difference: 192.75 
Lower limit: -110.1129 
Margin of error: 302.8629 

[1] 1182.333
[1] 1035.182
#+end_example

-> fe2-filing-tagstore-studies: no significant difference

*** filer/piler 

#+TBLNAME: fe2-filing-folder-fpiler
| filer | piler |
|-------+-------|
|   264 |   357 |
|   486 |   492 |
|   491 |   570 |
|   551 |   610 |
|   565 |   659 |
|   608 |   724 |
|   619 |   765 |
|   685 |   785 |
|   694 |   860 |
|   766 |   932 |
|   917 |   982 |
|   938 |       |
|   968 |       |

|      |  filer |  piler |
|------+--------+--------|
| mean | 657.85 | 703.27 |
| SE   |  49.11 |  45.92 |
#+TBLFM: @2$2=vmean(remote(fe2-filing-folder-fpiler,@2$1..@>$1));%.2f :: @3$2=vsdev(remote(fe2-filing-folder-fpiler,@2$1..@>$1))/sqrt(17);%.2f :: @2$3=vmean(remote(fe2-filing-folder-fpiler,@2$2..@>$2));%.2f :: @3$3=vsdev(remote(fe2-filing-folder-fpiler,@2$2..@>$2))/sqrt(17);%.2f

#+BEGIN_SRC R :var mydata= fe2-filing-folder-fpiler :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(filer,piler[0:11],.95)
mean(filer)
mean(piler)
#piler[0:11]
#+END_SRC

#+RESULTS:
#+begin_example

RESULTS

t: -0.03802016 
df: 12 
p: 0.9702968 

95% confidence interval 
Upper limit: 142.9326 
Mean difference: -2.538462 
Lower limit: -148.0095 
Margin of error: 145.4711 

[1] 657.8462
[1] NA
#+end_example

-> fe2-filing-folder-fpiler: no significant difference

#+TBLNAME: fe2-filing-tagstore-fpiler
| filer | piler |
|-------+-------|
|   665 |  1154 |
|   488 |   590 |
|   706 |   612 |
|   713 |   802 |
|  1231 |   646 |
|  1160 |  1972 |
|   801 |  1991 |
|  1070 |  1208 |
|  1255 |  1322 |
|  1455 |   660 |
|  1062 |  1168 |
|   971 |       |
|  1373 |       |

|      |  filer |   piler |
|------+--------+---------|
| mean | 996.15 | 1102.27 |
| SE   |  72.84 |  123.89 |
#+TBLFM: @2$2=vmean(remote(fe2-filing-tagstore-fpiler,@2$1..@>$1));%.2f :: @3$2=vsdev(remote(fe2-filing-tagstore-fpiler,@2$1..@>$1))/sqrt(17);%.2f :: @2$3=vmean(remote(fe2-filing-tagstore-fpiler,@2$2..@>$2));%.2f :: @3$3=vsdev(remote(fe2-filing-tagstore-fpiler,@2$2..@>$2))/sqrt(17);%.2f

#+BEGIN_SRC R :var mydata= fe2-filing-tagstore-fpiler :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(filer,piler[0:11],.95)
mean(filer)
mean(piler)
#+END_SRC

#+RESULTS:
#+begin_example

RESULTS

t: -0.4452542 
df: 12 
p: 0.6640618 

95% confidence interval 
Upper limit: 275.2344 
Mean difference: -70.69231 
Lower limit: -416.619 
Margin of error: 345.9267 

[1] 996.1538
[1] NA
#+end_example

-> fe2-filing-tagstore-fpiler: no significant difference

** Re-finding

copied from spreadsheet:
#+TBLNAME: fe2-refinding-folders-tagstore
| folders | tagstore |
|---------+----------|
| 157.6   | 63.7     |
| 230.1   | 116.31   |
| 110.93  | 84.56    |
| 94.1    | 68.77    |
| 129.35  | 334.16   |
| 173.6   | 104.46   |
| 69.14   | 57.21    |
| 97.1    | 119.64   |
| 109.89  | 103.26   |
| 84.59   | 99.24    |
| 90.17   | 70.53    |
| 142.48  | 101.3    |
| 71.97   | 195.93   |
| 78.79   | 143.71   |
| 65.46   | 169.61   |
| 136.96  | 89.97    |
| 88.1    | 135.6    |
| 79.4    | 143.8    |
| 79.1    | 140.3    |
| 72.3    | 131.52   |
| 172.2   | 435      |
| 83.2    | 190.47   |
| 107.6   | 172.2    |
| 125.8   | 129.3    |

copied from spreadsheet:
#+TBLNAME: fe2-refinding-folders-grps
| group1 | group2 |
|--------+--------|
| 69.14  | 65.46  |
| 84.59  | 71.97  |
| 90.17  | 72.3   |
| 94.1   | 78.79  |
| 97.1   | 79.1   |
| 109.89 | 79.4   |
| 110.93 | 83.2   |
| 125.8  | 88.1   |
| 129.35 | 107.6  |
| 157.6  | 136.96 |
| 173.6  | 142.48 |
| 230.1  | 172.2  |

copied from spreadsheet:
#+TBLNAME: fe2-refinding-tagstore-grps
| group1 | group2 |
|--------+--------|
| 57.21  | 89.97  |
| 63.7   | 101.3  |
| 68.77  | 131.52 |
| 70.53  | 135.6  |
| 84.56  | 140.3  |
| 99.24  | 143.71 |
| 103.26 | 143.8  |
| 104.46 | 169.61 |
| 116.31 | 172.2  |
| 119.64 | 190.47 |
| 129.3  | 195.93 |
| 334.16 | 435    |

*** group 1 vs. group 2

#+BEGIN_SRC R :var mydata=fe2-refinding-folders-grps :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(group1,group2,.95)
mean(group1)
mean(group2)
#+END_SRC

#+RESULTS:
#+begin_example

RESULTS

t: 6.090736 
df: 11 
p: 7.840017e-05 

95% confidence interval 
Upper limit: 33.44536 
Mean difference: 24.5675 
Lower limit: 15.68964 
Margin of error: 8.87786 

[1] 122.6975
[1] 98.13
#+end_example

-> refinding folders group: big significant difference: group2 faster

#+BEGIN_SRC R :var mydata= fe2-refinding-tagstore-grps :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(group1,group2,.95)
mean(group1)
mean(group2)
#+END_SRC

#+RESULTS:
#+begin_example

RESULTS

t: -10.91976 
df: 11 
p: 3.04829e-07 

95% confidence interval 
Upper limit: -46.46056 
Mean difference: -58.18917 
Lower limit: -69.91777 
Margin of error: 11.72860 

[1] 112.595
[1] 170.7842
#+end_example

-> refinding tagstore groups: (very) significant difference: group 1 faster

*** gender

copied from spreadsheet:
#+TBLNAME: fe2-refinding-folder-gender
| male   | female |
|--------+--------|
| 88.1   | 230.1  |
| 90.17  | 107.6  |
| 83.2   | 84.59  |
| 142.48 | 172.2  |
| 65.46  | 109.89 |
| 173.6  | 136.96 |
| 125.8  | 72.3   |
| 79.1   | 69.14  |
| 94.1   |        |
| 97.1   |        |
| 79.4   |        |
| 71.97  |        |
| 157.6  |        |
| 129.35 |        |
| 78.79  |        |
| 110.93 |        |

|      |   male | female |
|------+--------+--------|
| mean | 104.20 | 122.85 |
| SE   |   7.86 |  13.42 |
#+TBLFM: @2$2=vmean(remote(fe2-refinding-folder-gender,@2$1..@>$1));%.2f :: @3$2=vsdev(remote(fe2-refinding-folder-gender,@2$1..@>$1))/sqrt(17);%.2f :: @2$3=vmean(remote(fe2-refinding-folder-gender,@2$2..@>$2));%.2f :: @3$3=vsdev(remote(fe2-refinding-folder-gender,@2$2..@>$2))/sqrt(17);%.2f

#+BEGIN_SRC R :var mydata= fe2-refinding-folder-gender :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(male,female[0:8],.95)
#+END_SRC

#+RESULTS:
#+begin_example

RESULTS

t: -1.233508 
df: 15 
p: 0.2363665 

95% confidence interval 
Upper limit: 13.57687 
Mean difference: -18.65063 
Lower limit: -50.87812 
Margin of error: 32.22749 

#+end_example

-> refinding folder gender: no significant difference

copied from spreadsheet:
#+TBLNAME: fe2-refinding-tagstore-gender
|   male | female |
|--------+--------|
|  135.6 | 116.31 |
|  70.53 |  172.2 |
| 190.47 |  99.24 |
|  101.3 |    435 |
| 169.61 | 103.26 |
| 104.46 |  89.97 |
|  129.3 | 131.52 |
|  140.3 |  57.21 |
|  68.77 |        |
| 119.64 |        |
|  143.8 |        |
| 195.93 |        |
|   63.7 |        |
| 334.16 |        |
| 143.71 |        |
|  84.56 |        |

|      |   male | female |
|------+--------+--------|
| mean | 137.24 | 150.59 |
| SE   |  16.12 |  29.01 |
#+TBLFM: @2$2=vmean(remote(fe2-refinding-tagstore-gender,@2$1..@>$1));%.2f :: @3$2=vsdev(remote(fe2-refinding-tagstore-gender,@2$1..@>$1))/sqrt(17);%.2f :: @2$3=vmean(remote(fe2-refinding-tagstore-gender,@2$2..@>$2));%.2f :: @3$3=vsdev(remote(fe2-refinding-tagstore-gender,@2$2..@>$2))/sqrt(17);%.2f

#+BEGIN_SRC R :var mydata= fe2-refinding-tagstore-gender :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(male,female[0:8],.95)
mean(male)
mean(female[0:8])
#+END_SRC

#+RESULTS:
#+begin_example

RESULTS

t: -0.4014846 
df: 15 
p: 0.6937251 

95% confidence interval 
Upper limit: 57.5187 
Mean difference: -13.34875 
Lower limit: -84.2162 
Margin of error: 70.86745 

[1] 137.24
[1] 150.5888
#+end_example

-> refinding tagstore gender: no significant difference

*** tagging experience

#+TBLNAME: fe2-refinding-folder-taggers
| tagger | notagger |
|--------+----------|
|  71.97 |    65.46 |
|  78.79 |    69.14 |
|   79.4 |     72.3 |
|   83.2 |     79.1 |
|   88.1 |    84.59 |
|  90.17 |     94.1 |
|   97.1 |   109.89 |
|  107.6 |   110.93 |
|  125.8 |   136.96 |
| 129.35 |    230.1 |
| 142.48 |          |
|  157.6 |          |
|  172.2 |          |
|  173.6 |          |

|      | tagger | notagger |
|------+--------+----------|
| mean | 114.10 |   105.26 |
| SE   |   8.70 |    11.95 |
#+TBLFM: @2$2=vmean(remote(fe2-refinding-folder-taggers,@2$1..@>$1));%.2f :: @3$2=vsdev(remote(fe2-refinding-folder-taggers,@2$1..@>$1))/sqrt(17);%.2f :: @2$3=vmean(remote(fe2-refinding-folder-taggers,@2$2..@>$2));%.2f :: @3$3=vsdev(remote(fe2-refinding-folder-taggers,@2$2..@>$2))/sqrt(17);%.2f

#+BEGIN_SRC R :var mydata= fe2-refinding-folder-taggers :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(tagger,notagger[0:10],.95)
#+END_SRC

#+RESULTS:
#+begin_example

RESULTS

t: 1.269883 
df: 13 
p: 0.2263865 

95% confidence interval 
Upper limit: 49.93231 
Mean difference: 18.485 
Lower limit: -12.96231 
Margin of error: 31.44731 

#+end_example

-> fe2-refinding-folder-taggers: no significant difference

#+TBLNAME: fe2-refinding-tagstore-taggers
| tagger | notagger |
|--------+----------|
|   63.7 |    57.21 |
|  70.53 |    68.77 |
|  101.3 |    84.56 |
| 104.46 |    89.97 |
| 119.64 |    99.24 |
|  129.3 |   103.26 |
|  135.6 |   116.31 |
| 143.71 |   131.52 |
|  143.8 |    140.3 |
|  172.2 |   169.61 |
| 190.47 |          |
| 195.93 |          |
| 334.16 |          |
|    435 |          |

|      | tagger | notagger |
|------+--------+----------|
| mean | 167.13 |   106.08 |
| SE   |  24.73 |     8.29 |
#+TBLFM: @2$2=vmean(remote(fe2-refinding-tagstore-taggers,@2$1..@>$1));%.2f :: @3$2=vsdev(remote(fe2-refinding-tagstore-taggers,@2$1..@>$1))/sqrt(17);%.2f :: @2$3=vmean(remote(fe2-refinding-tagstore-taggers,@2$2..@>$2));%.2f :: @3$3=vsdev(remote(fe2-refinding-tagstore-taggers,@2$2..@>$2))/sqrt(17);%.2f

#+BEGIN_SRC R :var mydata= fe2-refinding-tagstore-taggers :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(tagger,notagger[0:10],.95)
mean(tagger)
mean(notagger[0:10])
#+END_SRC

#+RESULTS:
#+begin_example

RESULTS

t: 2.442442 
df: 13 
p: 0.02963074 

95% confidence interval 
Upper limit: 131.7193 
Mean difference: 69.89571 
Lower limit: 8.072121 
Margin of error: 61.82359 

[1] 167.1286
[1] 106.075
#+end_example


-> fe2-refinding-tagstore-taggers: significant difference: notaggers faster

*** platform

#+TBLNAME: fe2-refinding-folder-platform
| windows |  other |
|---------+--------|
|  110.93 |  157.6 |
|    94.1 |  230.1 |
|   173.6 |   94.1 |
|   69.14 | 129.35 |
|   69.14 |  173.6 |
|   84.59 |   97.1 |
|   90.17 | 109.89 |
|   71.97 | 142.48 |
|   65.46 |  78.79 |
|  136.96 |   88.1 |
|    88.1 |   88.1 |
|    88.1 |   79.4 |
|    79.1 |  172.2 |
|    72.3 |   83.2 |
|    72.3 |   83.2 |
|   107.6 |  107.6 |
|   125.8 |  107.6 |

|      | windows |  other |
|------+---------+--------|
| mean |   94.08 | 118.97 |
| SE   |    7.05 |  10.40 |
#+TBLFM: @2$2=vmean(remote(fe2-refinding-folder-platform,@2$1..@>$1));%.2f :: @3$2=vsdev(remote(fe2-refinding-folder-platform,@2$1..@>$1))/sqrt(17);%.2f :: @2$3=vmean(remote(fe2-refinding-folder-platform,@2$2..@>$2));%.2f :: @3$3=vsdev(remote(fe2-refinding-folder-platform,@2$2..@>$2))/sqrt(17);%.2f

#+BEGIN_SRC R :var mydata= fe2-refinding-folder-platform :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(windows,other,.95)
#+END_SRC

#+RESULTS:
#+begin_example

RESULTS

t: -1.865580 
df: 16 
p: 0.08054377 

95% confidence interval 
Upper limit: 3.392494 
Mean difference: -24.88529 
Lower limit: -53.16308 
Margin of error: 28.27779 

#+end_example

-> fe2-refinding-folder-platform: no significant difference

#+TBLNAME: fe2-refinding-tagstore-platform
| windows |  other |
|---------+--------|
|   84.56 |   63.7 |
|   68.77 | 116.31 |
|  104.46 |  68.77 |
|   57.21 | 334.16 |
|   57.21 | 104.46 |
|   99.24 | 119.64 |
|   70.53 | 103.26 |
|  195.93 |  101.3 |
|  169.61 | 143.71 |
|   89.97 |  135.6 |
|   135.6 |  135.6 |
|   135.6 |  143.8 |
|   140.3 |    435 |
|  131.52 | 190.47 |
|  131.52 | 190.47 |
|   172.2 |  172.2 |
|   129.3 |  172.2 |

|      | windows |  other |
|------+---------+--------|
| mean |  116.09 | 160.63 |
| SE   |   10.10 |  22.74 |
#+TBLFM: @2$2=vmean(remote(fe2-refinding-tagstore-platform,@2$1..@>$1));%.2f :: @3$2=vsdev(remote(fe2-refinding-tagstore-platform,@2$1..@>$1))/sqrt(17);%.2f :: @2$3=vmean(remote(fe2-refinding-tagstore-platform,@2$2..@>$2));%.2f :: @3$3=vsdev(remote(fe2-refinding-tagstore-platform,@2$2..@>$2))/sqrt(17);%.2f

#+BEGIN_SRC R :var mydata= fe2-refinding-tagstore-platform :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(windows,other,.95)
#+END_SRC

#+RESULTS:
#+begin_example

RESULTS

t: -1.847377 
df: 16 
p: 0.08326749 

95% confidence interval 
Upper limit: 6.570087 
Mean difference: -44.53647 
Lower limit: -95.64303 
Margin of error: 51.10656 

#+end_example

-> fe2-refinding-tagstore-platform: no significant difference

*** IT studies

#+TBLNAME: fe2-refinding-folder-studies
| ITstudies |  other |
|-----------+--------|
|    110.93 |  157.6 |
|    129.35 |  230.1 |
|      97.1 |   94.1 |
|    109.89 |  173.6 |
|    142.48 |  69.14 |
|     71.97 |  84.59 |
|     78.79 |  90.17 |
|      88.1 |  65.46 |
|      79.1 | 136.96 |
|     172.2 |   79.4 |
|      83.2 |   72.3 |
|     107.6 |        |

|      | ITstudies |  other |
|------+-----------+--------|
| mean |    105.89 | 113.95 |
| SE   |      7.25 |  12.97 |
#+TBLFM: @2$2=vmean(remote(fe2-refinding-folder-studies,@2$1..@>$1));%.2f :: @3$2=vsdev(remote(fe2-refinding-folder-studies,@2$1..@>$1))/sqrt(17);%.2f :: @2$3=vmean(remote(fe2-refinding-folder-studies,@2$2..@>$2));%.2f :: @3$3=vsdev(remote(fe2-refinding-folder-studies,@2$2..@>$2))/sqrt(17);%.2f

#+BEGIN_SRC R :var mydata= fe2-refinding-folder-studies :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(ITstudies,other[0:11],.95)
mean(ITstudies)
mean(other[0:11])
#+END_SRC

#+RESULTS:
#+begin_example

RESULTS

t: -0.7128384 
df: 11 
p: 0.4907912 

95% confidence interval 
Upper limit: 24.40968 
Mean difference: -11.6925 
Lower limit: -47.79468 
Margin of error: 36.10218 

[1] 105.8925
[1] 113.9473
#+end_example

-> fe2-refinding-folder-studies: no significant difference

#+TBLNAME: fe2-refinding-tagstore-studies
| ITstudies |  other |
|-----------+--------|
|     84.56 |   63.7 |
|    334.16 | 116.31 |
|    119.64 |  68.77 |
|    103.26 | 104.46 |
|     101.3 |  57.21 |
|    195.93 |  99.24 |
|    143.71 |  70.53 |
|     135.6 | 169.61 |
|     140.3 |  89.97 |
|       435 |  143.8 |
|    190.47 | 131.52 |
|     172.2 |        |

|      | ITstudies |  other |
|------+-----------+--------|
| mean |    179.68 | 101.37 |
| SE   |     25.22 |   8.78 |
#+TBLFM: @2$2=vmean(remote(fe2-refinding-tagstore-studies,@2$1..@>$1));%.2f :: @3$2=vsdev(remote(fe2-refinding-tagstore-studies,@2$1..@>$1))/sqrt(17);%.2f :: @2$3=vmean(remote(fe2-refinding-tagstore-studies,@2$2..@>$2));%.2f :: @3$3=vsdev(remote(fe2-refinding-tagstore-studies,@2$2..@>$2))/sqrt(17);%.2f

#+BEGIN_SRC R :var mydata= fe2-refinding-tagstore-studies :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(ITstudies,other[0:11],.95)
mean(ITstudies)
mean(other[0:11])
#+END_SRC

#+RESULTS:
#+begin_example

RESULTS

t: 3.097214 
df: 11 
p: 0.01015449 

95% confidence interval 
Upper limit: 139.3183 
Mean difference: 81.4425 
Lower limit: 23.56671 
Margin of error: 57.87579 

[1] 179.6775
[1] 101.3745
#+end_example

-> fe2-refinding-tagstore-studies: significant difference: non-IT faster

*** filer/piler 

#+TBLNAME: fe2-refinding-folder-fpiler
|  filer |  piler |
|--------+--------|
|  65.46 |  71.97 |
|  69.14 |  78.79 |
|   72.3 |  84.59 |
|   79.1 |   88.1 |
|   79.4 |   94.1 |
|   83.2 |  107.6 |
|  90.17 | 109.89 |
|   97.1 | 110.93 |
| 136.96 |  125.8 |
| 142.48 | 129.35 |
|  157.6 |  172.2 |
|  173.6 |        |
|  230.1 |        |

|      |  filer |  piler |
|------+--------+--------|
| mean | 113.59 | 106.67 |
| SE   |  12.25 |   6.93 |
#+TBLFM: @2$2=vmean(remote(fe2-refinding-folder-fpiler,@2$1..@>$1));%.2f :: @3$2=vsdev(remote(fe2-refinding-folder-fpiler,@2$1..@>$1))/sqrt(17);%.2f :: @2$3=vmean(remote(fe2-refinding-folder-fpiler,@2$2..@>$2));%.2f :: @3$3=vsdev(remote(fe2-refinding-folder-fpiler,@2$2..@>$2))/sqrt(17);%.2f

#+BEGIN_SRC R :var mydata= fe2-refinding-folder-fpiler :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(filer,piler[0:11],.95)
mean(filer)
mean(piler)
#+END_SRC

#+RESULTS:
#+begin_example

RESULTS

t: 0.7982522 
df: 12 
p: 0.4402363 

95% confidence interval 
Upper limit: 43.75827 
Mean difference: 11.73308 
Lower limit: -20.29211 
Margin of error: 32.02519 

[1] 113.5854
[1] NA
#+end_example


-> fe2-refinding-folder-fpiler: no significant difference

#+TBLNAME: fe2-refinding-tagstore-fpiler
|  filer |  piler |
|--------+--------|
|  57.21 |  68.77 |
|   63.7 |  84.56 |
|  70.53 |  99.24 |
|  89.97 | 103.26 |
|  101.3 |  129.3 |
| 104.46 |  135.6 |
| 116.31 | 143.71 |
| 119.64 |  172.2 |
| 131.52 | 195.93 |
|  140.3 | 334.16 |
|  143.8 |    435 |
| 169.61 |        |
| 190.47 |        |

|      |  filer |  piler |
|------+--------+--------|
| mean | 115.29 | 172.88 |
| SE   |   9.73 |  27.47 |
#+TBLFM: @2$2=vmean(remote(fe2-refinding-tagstore-fpiler,@2$1..@>$1));%.2f :: @3$2=vsdev(remote(fe2-refinding-tagstore-fpiler,@2$1..@>$1))/sqrt(17);%.2f :: @2$3=vmean(remote(fe2-refinding-tagstore-fpiler,@2$2..@>$2));%.2f :: @3$3=vsdev(remote(fe2-refinding-tagstore-fpiler,@2$2..@>$2))/sqrt(17);%.2f

#+BEGIN_SRC R :var mydata= fe2-refinding-tagstore-fpiler :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(filer,piler[0:11],.95)
mean(filer)
mean(piler)
#+END_SRC

#+RESULTS:
#+begin_example

RESULTS

t: -1.476824 
df: 12 
p: 0.1654791 

95% confidence interval 
Upper limit: 20.33858 
Mean difference: -42.78769 
Lower limit: -105.9140 
Margin of error: 63.12627 

[1] 115.2938
[1] NA
#+end_example

-> fe2-refinding-tagstore-fpiler: no significant difference

* Folders

** Average folder length

#+NAME: all_folders_-_average_length
#+BEGIN_SRC sh
awk '{ total += $1; count++ } END { print total/count }' \
    < TP_artifacts/folders_without_path_-_lengths.csv
#+END_SRC

#+RESULTS: all_folders_-_average_length
: 7.53583


** Boxplot

#+NAME: boxplot-data
#+BEGIN_SRC R :var data=list_of_all_folders_without_paths-lengths :exports code :results none
pdf('OPT_folder_length_boxplot.pdf')
boxplot(data, 
    names=c("folder length FE1"), 
    xlab="Formal Experiment 2", 
    ylab="number of characters in folders", 
    pars = list(boxwex = 0.3, staplewex = 0.5, 
    boxfill="lightblue"))
#+END_SRC

#+RESULTS: boxplot-data

*** result boxplot

The result boxplot is written to:

[[file:OPT_folder_length_boxplot.pdf]]


* Tags

** Average tag length

#+NAME: all_tags_-_average_length
#+BEGIN_SRC sh
awk '{ total += $1; count++ } END { print total/count }' \
    < TP_artifacts/tags_concated_-_raw_tags_single_unique_-_lengths.csv
#+END_SRC

#+RESULTS: all_tags_-_average_length
: 7.49953


** Boxplot

#+NAME: boxplot-data
#+BEGIN_SRC R :var data=all_tags_-_lengths :exports code :results none
pdf('OPT_OPT_tag_length_boxplot.pdf')
boxplot(data, 
    names=c("tag length FE1"), 
    xlab="Formal Experiment 2", 
    ylab="number of characters in tags", 
    pars = list(boxwex = 0.3, staplewex = 0.5, 
    boxfill="lightblue"))
#+END_SRC

#+RESULTS: boxplot-data

*** result boxplot

The result boxplot is written to:

[[file:OPT_tag_length_boxplot.pdf]]


* combined boxplot tag and folder name length

#+NAME: boxplot-folder-tag-lengths
#+BEGIN_SRC R :var tags=all_tags_-_lengths :var folders=list_of_all_folders_without_paths-lengths :exports code :results none
pdf('OPT_folder_and_tag_length_boxplot.pdf')
boxplot(list(folders$V1, tags$V1), 
    names=c("folder length", "tag length"), 
    xlab="Formal Experiment 2", 
    ylab="number of characters", 
    pars = list(boxwex = 0.3, staplewex = 0.5, 
    boxfill="lightblue"))
#+END_SRC

#+RESULTS: boxplot-folder-tag-lengths

** result boxplot

The result boxplot is written to:

[[file:OPT_folder_and_tag_length_boxplot.pdf]]


* combined boxplot unique tag and folder names

#+NAME: boxplot-folder-tag-unique-numbers
#+BEGIN_SRC R :var tags=unique-tags-per-TP :var folders=unique-folders-per-TP :exports code :results none
pdf('OPT_folder_and_tag_uniques_boxplot.pdf')
boxplot(list(folders$V1, tags$V1), 
    names=c("folders", "tags"), 
    xlab="Formal Experiment 2", 
    ylab="unique occurrences per TP", 
    pars = list(boxwex = 0.3, staplewex = 0.5, 
    boxfill="lightblue"))
#+END_SRC

#+RESULTS: boxplot-folder-tag-unique-numbers

** result boxplot

The result boxplot is written to:

[[file:OPT_folder_and_tag_uniques_boxplot.pdf]]




* combined boxplot filing times

#+NAME: boxplot-filing-times
#+BEGIN_SRC R :var data=fe2-filing-folders-tagstore  :exports code :results none
pdf('FE2_filing_times_boxplot.pdf')

boxplot(list(data$folders, data$tagstore), 
    names=c("folders", "tagstore"), 
    #xlab="Formal Experiment 2", 
    ylab="filing times", 
    pars = list(boxwex = 0.3, staplewex = 0.5, 
    boxfill="lightblue"))
#+END_SRC

#+RESULTS: boxplot-filing-times


** result boxplot

The result boxplot is written to:

[[file:~/ist/tagstore/tshci/2011-04-tagstore-formal-experiment/analysis_and_derived_data][FE2_filing_times_boxplot.pdf]]


* combined boxplot refinding times

#+NAME: boxplot-refinding-times
#+BEGIN_SRC R :var data=fe2-refinding-folders-tagstore  :exports code :results none
pdf('FE2_refinding_times_boxplot.pdf')

boxplot(list(data$folders, data$tagstore), 
    names=c("folders", "tagstore"), 
    #xlab="Formal Experiment 2", 
    ylab="re-finding times", 
    pars = list(boxwex = 0.3, staplewex = 0.5, 
    boxfill="lightblue"))
#+END_SRC

#+RESULTS: boxplot-refinding-times


** result boxplot

The result boxplot is written to:

[[file:~/ist/tagstore/tshci/2011-04-tagstore-formal-experiment/analysis_and_derived_data][FE2_refinding_times_boxplot.pdf]]


* FE2, filing, all TPs

#+TBLNAME: fe2-filing-allTPs
| Filing_Folders | Filing_tagstore |
|----------------+-----------------|
|            264 |             488 |
|            486 |             590 |
|            570 |             612 |
|            608 |             646 |
|            610 |             665 |
|            659 |             706 |
|            685 |             713 |
|            766 |             802 |
|            785 |            1154 |
|            860 |            1160 |
|            968 |            1168 |
|            982 |            1231 |
|            357 |             660 |
|            491 |             801 |
|            492 |             971 |
|            551 |            1062 |
|            565 |            1070 |
|            619 |            1208 |
|            694 |            1255 |
|            724 |            1322 |
|            765 |            1373 |
|            917 |            1455 |
|            932 |            1972 |
|            938 |            1991 |


#+BEGIN_SRC R :var mydata=fe2-filing-allTPs :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(Filing_Folders,Filing_tagstore,.95)
#+END_SRC

#+RESULTS:
#+begin_example

RESULTS

t: -6.10578 
df: 23 
p: 3.150412e-06 

95% confidence interval 
Upper limit: -242.0807 
Mean difference: -366.125 
Lower limit: -490.1693 
Margin of error: 124.0443 

#+end_example

- (very) significant difference!
  - because p<<0.05 and confidence interval does not include 0

|      | folders | tagstore |
|------+---------+----------|
| mean |  678.67 |  1044.79 |
| SE   |   46.98 |    98.05 |
#+TBLFM: @2$2=vmean(remote(fe2-filing-allTPs,@2$1..@>$1));%.2f :: @3$2=vsdev(remote(fe2-filing-allTPs,@2$1..@>$1))/sqrt(17);%.2f :: @2$3=vmean(remote(fe2-filing-allTPs,@2$2..@>$2));%.2f :: @3$3=vsdev(remote(fe2-filing-allTPs,@2$2..@>$2))/sqrt(17);%.2f

* FE2, re-finding, all TPs

#+TBLNAME: fe2-re-finding-allTPs
| Refinding_Folders | Refinding_tagstore |
|-------------------+--------------------|
|             157.6 |               63.7 |
|             230.1 |             116.31 |
|            110.93 |              84.56 |
|              94.1 |              68.77 |
|            129.35 |             334.16 |
|             173.6 |             104.46 |
|             69.14 |              57.21 |
|              97.1 |             119.64 |
|            109.89 |             103.26 |
|             84.59 |              99.24 |
|             90.17 |              70.53 |
|            142.48 |              101.3 |
|             71.97 |             195.93 |
|             78.79 |             143.71 |
|             65.46 |             169.61 |
|            136.96 |              89.97 |
|              88.1 |              135.6 |
|              79.4 |              143.8 |
|              79.1 |              140.3 |
|              72.3 |             131.52 |
|             172.2 |                435 |
|              83.2 |             190.47 |
|             107.6 |              172.2 |
|             125.8 |              129.3 |


#+BEGIN_SRC R :var mydata=fe2-re-finding-allTPs :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(Refinding_Folders,Refinding_tagstore,.95)
#+END_SRC

#+RESULTS:
#+begin_example

RESULTS

t: -1.730094 
df: 23 
p: 0.09701212 

95% confidence interval 
Upper limit: 6.120406 
Mean difference: -31.27583 
Lower limit: -68.67207 
Margin of error: 37.39624 

#+end_example

- no significant difference
  - because p>0.05 and confidence interval contains 0

|      | folders | tagstore |
|------+---------+----------|
| mean |  110.41 |   141.69 |
| SE   |    9.99 |    20.69 |
#+TBLFM: @2$2=vmean(remote(fe2-re-finding-allTPs,@2$1..@>$1));%.2f :: @3$2=vsdev(remote(fe2-re-finding-allTPs,@2$1..@>$1))/sqrt(17);%.2f :: @2$3=vmean(remote(fe2-re-finding-allTPs,@2$2..@>$2));%.2f :: @3$3=vsdev(remote(fe2-re-finding-allTPs,@2$2..@>$2))/sqrt(17);%.2f

* FE2, re-finding 2-6, all TPs

#+TBLNAME: fe2-re-finding-2-6-allTPs
| Refinding_Folders | Refinding_tagstore |
|-------------------+--------------------|


#+BEGIN_SRC R :var mydata=fe2-re-finding-2-6-allTPs :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(Refinding_Folders,Refinding_tagstore,.95)
#+END_SRC

#+RESULTS:

* FE2, refinding_clicks

#+TBLNAME: fe2-refinding_folders_clicks
|       item1 | item2 | item3 | item4 | item5 | item6 | item7 | item8 | item9 | item10 | averageTP | averageTP2-10 |
|-------------+-------+-------+-------+-------+-------+-------+-------+-------+--------+-----------+---------------|
|           2 |     2 |     2 |     3 |     2 |    11 |     3 |     2 |     2 |      2 |      3.10 |          3.22 |
|           2 |     9 |     2 |     2 |     2 |     2 |     2 |     3 |     2 |      7 |      3.30 |          3.44 |
|           3 |     8 |     3 |     3 |     2 |     2 |     3 |     3 |     2 |      3 |      3.20 |          3.22 |
|           9 |     3 |     3 |     3 |     2 |     2 |     2 |     4 |     3 |      3 |      3.40 |          2.78 |
|           3 |     3 |     7 |     3 |     3 |     8 |     4 |     3 |     5 |      3 |      4.20 |          4.33 |
|           2 |     2 |     2 |     3 |     2 |     2 |     2 |     3 |    16 |      3 |      3.70 |          3.89 |
|           2 |     2 |     3 |     2 |     2 |     2 |     2 |     2 |     2 |      2 |      2.10 |          2.11 |
|           2 |     3 |     2 |     1 |     2 |     5 |     2 |     2 |     1 |      2 |      2.20 |          2.22 |
|           2 |     3 |     6 |     4 |     2 |     7 |     3 |     4 |     2 |      5 |      3.80 |          4.00 |
|           2 |     2 |     2 |     2 |     2 |     2 |     2 |     2 |     2 |      2 |      2.00 |          2.00 |
|           3 |     3 |     3 |     3 |     3 |     3 |    14 |     3 |     3 |      3 |      4.10 |          4.22 |
|           4 |     2 |     3 |    27 |     2 |     5 |     3 |     7 |     3 |      3 |      5.90 |          6.11 |
|           5 |     2 |     5 |     3 |     3 |     3 |     3 |     3 |     3 |      3 |      3.30 |          3.11 |
|           4 |     5 |     4 |     4 |     3 |     4 |     3 |     4 |     3 |      8 |      4.20 |          4.22 |
|           2 |     2 |     2 |     2 |     2 |     2 |     2 |     2 |     2 |      2 |      2.00 |          2.00 |
|           2 |     2 |    14 |     2 |     3 |     5 |     7 |     5 |     1 |      3 |      4.40 |          4.67 |
|           2 |     2 |     8 |     2 |     2 |     4 |     2 |     8 |     2 |      2 |      3.40 |          3.56 |
|           2 |     2 |     3 |     5 |     3 |     2 |     3 |     2 |     2 |      3 |      2.70 |          2.78 |
|           4 |     2 |     2 |     2 |     2 |     2 |     3 |     2 |     2 |      2 |      2.30 |          2.11 |
|           2 |     2 |       |     2 |     3 |     2 |     2 |     2 |     2 |      2 |      2.11 |          2.12 |
|           2 |     2 |     2 |     2 |     2 |     2 |     3 |     2 |    44 |      2 |      6.30 |          6.78 |
|           3 |     3 |     3 |     3 |     3 |     3 |     6 |     3 |     9 |      3 |      3.90 |          4.00 |
|           3 |     2 |     2 |     5 |     4 |     2 |     3 |     2 |    15 |      4 |      4.20 |          4.33 |
|           5 |     5 |     8 |     3 |     3 |     4 |     4 |     3 |     3 |      3 |      4.10 |          4.00 |
|-------------+-------+-------+-------+-------+-------+-------+-------+-------+--------+-----------+---------------|
| Average all |       |       |       |       |       |       |       |       |        |      3.50 |          3.55 |
#+TBLFM: @I$11..@II$11=vmean($1..$10);%.2f::@I$12..@II$12=vmean($2..$10);%.2f::@26$11=vmean(@I$11..@II$11);%.2f::@26$12=vmean(@I$12..@II$12);%.2f

#+TBLNAME: fe2-refinding_folders_clicks-TEST
| average |
|---------|
|       0 |
#+TBLFM: $1=remote(fe2-refinding_folders_clicks,$1)

#+TBLNAME: fe2-refinding_tagstore_clicks
|       item1 | item2 | item3 | item4 | item5 | item6 | item7 | item8 | item9 | item10 | averageTP | averageTP2-10 |
|-------------+-------+-------+-------+-------+-------+-------+-------+-------+--------+-----------+---------------|
|           2 |     2 |     4 |     3 |     2 |     2 |     3 |     2 |     2 |      2 |      2.40 |          2.44 |
|           2 |     2 |     2 |     2 |     6 |     2 |     2 |     3 |       |      2 |      2.56 |          2.62 |
|           3 |     3 |     3 |     2 |     2 |     2 |     3 |     3 |     2 |      2 |      2.50 |          2.44 |
|           2 |     2 |     2 |     2 |       |     2 |     2 |     2 |     3 |      2 |      2.11 |          2.12 |
|           5 |     3 |     5 |     3 |     6 |    17 |     2 |     2 |     2 |      2 |      4.70 |          4.67 |
|           5 |     2 |     2 |     2 |     4 |     4 |     2 |     2 |     2 |      2 |      2.70 |          2.44 |
|           2 |     2 |     2 |     2 |     2 |     2 |     3 |     2 |     2 |      2 |      2.10 |          2.11 |
|           2 |     3 |     2 |     2 |     2 |       |     2 |     3 |     3 |      2 |      2.33 |          2.38 |
|           2 |     3 |     3 |     2 |     4 |     4 |     4 |     2 |     2 |      3 |      2.90 |          3.00 |
|           3 |     2 |     2 |     4 |     2 |     2 |     4 |     2 |     2 |      2 |      2.50 |          2.44 |
|           2 |     2 |     2 |     2 |     2 |     2 |     2 |     2 |     2 |      2 |      2.00 |          2.00 |
|           3 |     2 |     2 |     2 |     2 |     2 |     3 |     2 |     2 |      9 |      2.90 |          2.89 |
|           2 |    10 |     2 |     2 |     2 |     3 |     2 |     6 |     2 |      4 |      3.50 |          3.67 |
|           2 |     2 |     2 |     2 |     2 |    16 |     2 |     2 |     4 |      3 |      3.70 |          3.89 |
|           5 |     2 |    14 |     3 |     2 |     2 |     2 |     2 |     2 |      2 |      3.60 |          3.44 |
|           1 |       |     2 |     3 |     5 |     5 |     2 |     2 |     2 |      2 |      2.67 |          2.88 |
|           2 |     3 |     9 |     2 |     2 |     9 |     2 |     2 |     4 |      2 |      3.70 |          3.89 |
|           2 |     3 |     3 |     2 |     6 |     7 |     2 |     3 |     2 |      2 |      3.20 |          3.33 |
|           7 |    12 |     2 |     3 |     2 |     2 |     2 |     2 |     2 |     10 |      4.40 |          4.11 |
|           2 |     8 |     4 |     3 |     2 |     4 |     2 |     2 |     2 |      2 |      3.10 |          3.22 |
|          50 |     8 |     3 |     2 |     2 |     6 |    14 |     8 |     6 |      2 |     10.10 |          5.67 |
|           3 |     2 |     4 |    16 |     3 |    23 |     3 |     2 |    12 |      6 |      7.40 |          7.89 |
|           3 |     3 |    21 |     2 |     2 |     7 |     2 |     2 |     2 |      2 |      4.60 |          4.78 |
|          10 |     2 |     2 |     3 |     2 |     2 |     2 |     3 |     2 |      2 |      3.00 |          2.22 |
|-------------+-------+-------+-------+-------+-------+-------+-------+-------+--------+-----------+---------------|
| Average all |       |       |       |       |       |       |       |       |        |      3.53 |          3.36 |
#+TBLFM: @I$11..@II$11=vmean($1..$10);%.2f::@I$12..@II$12=vmean($2..$10);%.2f::@26$11=vmean(@I$11..@II$11);%.2f::@26$12=vmean(@I$12..@II$12);%.2f


#+TBLNAME: fe2-refinding-clicks
|         | folders | tagstore |
|---------+---------+----------|
| item 1  |         |          |
| item 2  |         |          |
| item 3  |         |          |
| item 4  |         |          |
| item 5  |         |          |
| item 6  |         |          |
| item 7  |         |          |
| item 8  |         |          |
| item 9  |         |          |
| item 10 |         |          |


#+BEGIN_SRC R :var mydata=fe2-refinding-clicks :results output
source("~/templates_labels/R/PracStats_v20120108.R")
attach(mydata)
test.t.paired.fromarrays(folders,tagstore,.95)
#+END_SRC

#+RESULTS:


#+BEGIN_SRC R :var folders=fe2-refinding_folders_clicks :var tagstore=fe2-refinding_tagstore_clicks :results output
source("~/templates_labels/R/PracStats_v20120108.R")
test.t.paired.fromarrays(as.numeric(folders$V11[2:26]),as.numeric(tagstore$V11[2:26]),.95)
#+END_SRC

#+RESULTS:
#+begin_example

RESULTS

t: -0.1011685 
df: 24 
p: 0.9202571 

95% confidence interval 
Upper limit: 0.6130588 
Mean difference: -0.0316 
Lower limit: -0.6762588 
Margin of error: 0.6446588 

#+end_example


* Success rates

** Folders

- 24*10 samples = 240 re-find processes of files
- 1x "TC" for folder condition

| *samples* | *unsuccessful* | *rate* |
|       240 |              1 |   99.6 |
#+TBLFM: @2$3=100*($1-$2)/$1;%.1f

** tagstore

- 24*10 samples = 240 re-find processes of files
- 3x "TC" for tagstore condition
- 1x "TS" for tagstore condition

| *samples* | *unsuccessful* | *rate* |
|       240 |              4 |   98.3 |
#+TBLFM: @2$3=100*($1-$2)/$1;%.1f
